open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_lifecycle.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_ap_lifecycle.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Chip-owned AP startup, READY publication and supervision lifecycle.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <sched.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/kmalloc.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_ap_lifecycle.h>
#include <arch/chip/bk7258_ap_platform.h>

#ifdef CONFIG_BK7258_PSRAM
#  include <arch/chip/bk7258_psram.h>
#endif

#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#  include "bk7258_rptun_mbox.h"
#endif
#ifdef CONFIG_BK7258_RPTUN
#  include "bk7258_rptun.h"
#endif
#ifdef CONFIG_BK7258_PM_CLOCK
#  include <arch/chip/bk7258_pm.h>
#endif
#ifdef CONFIG_BK7258_AP_SUPERVISOR
#  include "bk7258_ap_health.h"
#endif
#ifdef CONFIG_BK7258_BT_IPC
#  include <arch/chip/bk7258_bt_ipc.h>
#endif
#ifdef CONFIG_BK7258_OTA_MANAGER
#  include <arch/chip/bk7258_ota_manager.h>
#endif
#ifdef CONFIG_BK7258_WIFI_VNET
#  include <arch/chip/bk7258_wifi.h>
#endif

#include "arm_internal.h"
#include "bk7258_clockdiag.h"

extern const void *const _vectors[80];

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_SCB_VTOR             (*(volatile uint32_t *)0xe000ed08u)
#define BK7258_SYSTICK_CTRL         (*(volatile uint32_t *)0xe000e010u)
#define BK7258_SYSTICK_RELOAD       (*(volatile uint32_t *)0xe000e014u)
#define BK7258_SYSTICK_CURRENT      (*(volatile uint32_t *)0xe000e018u)
#define BK7258_SYSTICK_ENABLE       (1u << 0)
#define BK7258_SYSTICK_TICKINT      (1u << 1)
#define BK7258_SCB_CCR              (*(volatile uint32_t *)0xe000ed14u)
#define BK7258_SCB_CCR_DCACHE       (1u << 16)
#define BK7258_SCB_CCR_ICACHE       (1u << 17)
#define BK7258_MPU_CTRL             (*(volatile uint32_t *)0xe000ed94u)
#define BK7258_MPU_RNR              (*(volatile uint32_t *)0xe000ed98u)
#define BK7258_MPU_RBAR             (*(volatile uint32_t *)0xe000ed9cu)
#define BK7258_MPU_RLAR             (*(volatile uint32_t *)0xe000eda0u)
#define BK7258_MPU_MAIR0            (*(volatile uint32_t *)0xe000edc0u)
#define BK7258_MPU_SRAM_REGION      15u
#define BK7258_MPU_SRAM_RBAR        0x2800001au
#define BK7258_MPU_SRAM_RLAR        0x3fffffe3u
#ifdef CONFIG_BK7258_PSRAM
#  define BK7258_MPU_PSRAM_REGION   6u
#  define BK7258_MPU_PSRAM_RBAR     0x60000002u
#  define BK7258_MPU_PSRAM_RLAR     0x63ffffe3u
#endif
#define BK7258_MPU_ATTR1_MASK       0x0000ff00u
#define BK7258_MPU_ATTR1_NOCACHE    0x00004400u
#define BK7258_MPU_CTRL_EXPECTED    0x7u
#ifdef CONFIG_BK7258_AP_SUPERVISOR
#  define BK7258_AP_HEARTBEAT_US \
    ((uint32_t)CONFIG_BK7258_AP_HEARTBEAT_PERIOD_MS * 1000u)
#else
#  define BK7258_AP_HEARTBEAT_US    100000u
#endif

#ifdef CONFIG_BK7258_RPTUN
#  define BK7258_AP_RPTUN_INIT_PRIORITY  226
static_assert(BK7258_AP_RPTUN_INIT_PRIORITY >
              CONFIG_BK7258_RPTUN_RX_PRIORITY,
              "AP RPTUN init coordinator must outrank RX worker");
static_assert(BK7258_AP_RPTUN_INIT_PRIORITY > CONFIG_RPTUN_PRIORITY,
              "AP RPTUN init coordinator must outrank RPTUN worker");
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
#  define BK7258_CPU2_EXPECTED_STATE \
    BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE
#  define BK7258_CPU2_EXPECTED_MASK  0x3u
#else
#  define BK7258_CPU2_EXPECTED_STATE \
    BK7258_CPU2_PROBE_STATE_SECONDARY_READY
#  define BK7258_CPU2_EXPECTED_MASK  0x1u
#endif

#if defined(CONFIG_BK7258_PM_CLOCK) && \
    (defined(CONFIG_BK7258_WIFI_VNET) || \
     defined(CONFIG_BK7258_BT_IPC))
#  define BK7258_AP_STARTUP_FREQ_VOTE 1
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_ap_lifecycle_s
{
  bool startup_called;
  bool startup_complete;
  bool ready_published;
#ifdef CONFIG_BK7258_RPTUN
  struct sched_param saved_priority;
  bool priority_raised;
#endif
#ifdef CONFIG_BK7258_PSRAM_TEST
  struct bk7258_psram_test_result_s psram_test;
#endif
#ifdef BK7258_AP_STARTUP_FREQ_VOTE
  bool pm_startup_vote;
#endif
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_ap_lifecycle_s g_bk7258_ap_lifecycle;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_BK7258_RPTUN_MBOX
static uint32_t bk7258_ap_mbox_receive(void)
{
  return bk7258_rptun_mbox_take_lifecycle();
}

static void bk7258_ap_mbox_send(uint32_t event)
{
#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY
  /* The CP lifecycle waiter polls this shared state every millisecond.  Do
   * not spend the SDK mailbox's first AP-to-CP in-flight slot on a redundant
   * lifecycle edge: on BK7258 the immediately following RPMsg VRING1 edge can
   * otherwise remain BUSY after READY and prevent the initial NS bind.  The
   * CP-to-AP standby request/abort/wake path remains a physical mailbox wake.
   */

  (void)event;
#else
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if (bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_LIFECYCLE,
                             state->generation, event) >= 0)
    {
      state->ap_to_cp_doorbells++;
    }
#endif

  __asm volatile ("dmb sy" ::: "memory");
}
#else
static inline volatile uint32_t *bk7258_ap_mbox(uint32_t base)
{
  return (volatile uint32_t *)(uintptr_t)base;
}

