open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_lifecycle.c
int bk7258_ap_lifecycle_startup(FAR uint32_t *failure)
{
  FAR struct bk7258_ap_lifecycle_s *lifecycle =
    &g_bk7258_ap_lifecycle;
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
#ifdef CONFIG_BK7258_RPTUN
  volatile struct bk7258_rptun_control_s *rptun =
    bk7258_rptun_control();
  struct sched_param startup_priority;
#endif
  int error;
  int ret;

  if (failure == NULL)
    {
      return -EINVAL;
    }

  *failure = BK7258_AP_ERROR_NONE;
  if (lifecycle->startup_called)
    {
      return -EALREADY;
    }

  lifecycle->startup_called = true;

  if (state->magic != BK7258_AP_BOOT_STATE_MAGIC ||
      state->version != BK7258_AP_BOOT_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_boot_state_s))
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BAD_BOOT_STATE, -EINVAL);
    }

  error = bk7258_ap_validate_runtime();
  if (error != BK7258_AP_ERROR_NONE)
    {
      return bk7258_ap_startup_failed(failure, (uint32_t)error, -EIO);
    }

  /* board_late_initialize() has already run the AP chip preparation before
   * NuttX starts this initial application.  Consume only its cached result so
   * a missing or reordered late hook fails closed instead of silently moving
   * SDK/PM/temperature/PSRAM initialization later in boot.
   */

  ret = bk7258_ap_platform_result();
  if (ret < 0)
    {
      struct bk7258_platform_status_s platform;
      uint32_t platform_error = BK7258_AP_ERROR_PERIPHERALS;

      if (bk7258_ap_platform_get_status(&platform) >= 0 &&
          platform.first_error_stage == BK7258_AP_STAGE_PSRAM)
        {
          platform_error = BK7258_AP_ERROR_PSRAM;
        }

      return bk7258_ap_startup_failed(failure, platform_error, ret);
    }

#ifdef CONFIG_BK7258_PSRAM
#ifdef CONFIG_BK7258_PSRAM_SYSTEM_HEAP
  /* Preserve the baseline boundary: AP validates its boot contract before
   * donating a region from the already initialized private PSRAM heap to the
   * NuttX system heap.
   */

  ret = bk7258_psram_add_system_heap(
    CONFIG_BK7258_PSRAM_SYSTEM_HEAP_SIZE);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PSRAM, ret);
    }
#ifdef CONFIG_BK7258_PSRAM_EXT_SYSTEM_HEAP
  ret = bk7258_psram_add_extended_system_heap();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PSRAM, ret);
    }

  syslog(LOG_NOTICE, "BPSR AP SYSTEM HEAP base=%08lx size=%lu\n",
         (unsigned long)BK7258_PSRAM_AP_EXT_HEAP_BASE,
         (unsigned long)CONFIG_BK7258_PSRAM_EXT_SYSTEM_HEAP_SIZE);
#endif
#endif

  state->reserved[BK7258_PSRAM_AP_RESERVED_HEAP] =
    BK7258_PSRAM_AP_HEAP_BASE;
  state->reserved[BK7258_PSRAM_AP_RESERVED_GATE] =
    BK7258_PSRAM_AP_HEAP_READY;
#ifdef CONFIG_BK7258_PSRAM_TEST
  memset(&lifecycle->psram_test, 0, sizeof(lifecycle->psram_test));
  state->reserved[BK7258_PSRAM_AP_RESERVED_RESULT] =
    (uint32_t)(uintptr_t)&lifecycle->psram_test;
  state->reserved[BK7258_PSRAM_AP_RESERVED_MAGIC] =
    BK7258_PSRAM_AP_RESULT_READY;
#endif
  __asm volatile ("dmb sy" ::: "memory");
#endif

#ifdef CONFIG_BK7258_RPTUN
  /* kthread_create() activates the new task before returning.  Both the
   * mailbox RX worker and stock RPTUN worker intentionally outrank normal
   * applications, but they must not outrank the coordinator which is still
   * constructing and pinning them.  Otherwise a cold-start context switch
   * can leave this init path inside kthread_create() indefinitely.  After
   * READY, N10 keeps this primary management/heartbeat loop at its reserved
   * supervisor priority; profiles without N10 restore the init priority.
   */

  ret = sched_getparam(0, &lifecycle->saved_priority);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BAD_BOOT_STATE, ret);
    }

  startup_priority = lifecycle->saved_priority;
  startup_priority.sched_priority = BK7258_AP_RPTUN_INIT_PRIORITY;
  ret = sched_setparam(0, &startup_priority);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BAD_BOOT_STATE, ret);
    }

  lifecycle->priority_raised = true;
#endif

#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
  error = bk7258_ap_validate_secondary_bootstrap();
  if (error != BK7258_AP_ERROR_NONE)
    {
      return bk7258_ap_startup_failed(failure, (uint32_t)error, -EIO);
    }
#else
  ret = bk7258_cpu2_probe_start(BK7258_CPU2_PROBE_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_PROBE, ret);
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  ret = bk7258_ap_smp_scheduler_selftest(
    BK7258_AP_SMP_DEFAULT_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_SMP_SCHEDULER, ret);
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_AFFINITY
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_SEM_WAKE_LOOP_TIMEOUT_MS);
#  elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_SEM_WAKE_TIMEOUT_MS);
#  else
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_AFFINITY_TIMEOUT_MS);
#  endif
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      error = BK7258_AP_ERROR_CPU2_SEM_WAKE_LOOP;
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
      error = BK7258_AP_ERROR_CPU2_SEM_WAKE;
#else
      error = BK7258_AP_ERROR_CPU2_AFFINITY;
#endif
      return bk7258_ap_startup_failed(failure, (uint32_t)error, ret);
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG
  ret = bk7258_ap_smp_bp2p_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_BP2P, ret);
    }
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_DUALTASK)
  ret = bk7258_ap_smp_bdul_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_BDUL, ret);
    }
#elif defined(CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION)
  ret = bk7258_ap_smp_bmig_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_BMIG, ret);
    }
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_TIMED_WAKE)
  ret = bk7258_ap_smp_btim_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_BTIM, ret);
    }
#elif defined(CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE)
  ret = bk7258_ap_smp_blcy_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_CPU2_BLCY, ret);
    }
#endif

