open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_lifecycle.c
#ifdef CONFIG_BK7258_PSRAM_TEST
  ret = bk7258_psram_heap_test(CONFIG_BK7258_PSRAM_TEST_ITERATIONS,
                               true, &lifecycle->psram_test);
  if (ret < 0 || lifecycle->psram_test.status < 0 ||
      lifecycle->psram_test.completed[0] !=
        CONFIG_BK7258_PSRAM_TEST_ITERATIONS ||
      lifecycle->psram_test.completed[1] !=
        CONFIG_BK7258_PSRAM_TEST_ITERATIONS ||
      lifecycle->psram_test.observed_cpu[0] != 0u ||
      lifecycle->psram_test.observed_cpu[1] != 1u)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PSRAM, ret);
    }

  state->reserved[BK7258_PSRAM_AP_RESERVED_GATE] =
    BK7258_PSRAM_AP_TEST_PASSED;
  __asm volatile ("dmb sy" ::: "memory");
#endif

  /* Publish a second, independently scheduled liveness source only after all
   * N8 SMP gates have passed.  The task is permanent for this AP generation
   * and pinned to logical CPU1; a failed first increment is a startup failure,
   * not a degraded READY state.
   */

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  ret = bk7258_ap_health_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_SUPERVISOR, ret);
    }
#endif

  /* Keep AP-local N8 validation ahead of logical transport ownership so its
   * zero-length SMP IPI gates run without RPMsg traffic.  The SDK physical
   * MBOX0 driver was already initialized by the AP SMP bootstrap.  The
   * temporarily elevated coordinator priority above is what makes the later
   * synchronous worker creation deterministic; changing the SDK/NuttX source
   * or moving logical transport ahead of the N8 gates is unnecessary.
   */

#ifdef CONFIG_BK7258_RPTUN_MBOX
#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_MBOX_ENTER, __ATOMIC_RELEASE);
#endif
  ret = bk7258_rptun_mbox_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BAD_BOOT_STATE, ret);
    }

#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_MBOX_READY, __ATOMIC_RELEASE);
#endif
#endif

#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_RPTUN_ENTER, __ATOMIC_RELEASE);
  ret = bk7258_rptun_initialize(state->generation);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BAD_BOOT_STATE, ret);
    }

#ifdef CONFIG_BK7258_RPMSGFS
  ret = bk7258_rpmsgfs_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_RPMSGFS, ret);
    }
#endif

  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_RPTUN_READY, __ATOMIC_RELEASE);
#endif

#ifdef CONFIG_BK7258_OTA_MANAGER
  ret = bk7258_ota_manager_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PERIPHERALS, ret);
    }

#endif

#ifdef CONFIG_BK7258_PM_CLOCK
  /* Recheck the idempotent PM-client registration after RPTUN creation, at
   * the same boundary as the baseline AP path.  The v3.1.1.9 radio startup
   * path faults when the shared CPU clock is only
   * 120 MHz.  Radio profiles hold a bounded AP-startup vote while Wi-Fi and
   * BT/BLE are initialized.  A transport-only profile must not issue this
   * request before RPMsg Name Service has connected: it has no high-load
   * module to protect, and normal module votes remain available once the
   * link is ready.
   */

  ret = bk7258_pm_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PERIPHERALS, ret);
    }

#ifdef BK7258_AP_STARTUP_FREQ_VOTE
  ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_CPU1,
                                 BK7258_PM_OPP_320M);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PERIPHERALS, ret);
    }

  lifecycle->pm_startup_vote = true;
#endif
#endif

#ifdef CONFIG_BK7258_WIFI_VNET
  ret = bk7258_wifi_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_WIFI, ret);
    }


  ret = bk7258_wifi_control_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_WIFI, ret);
    }


#endif

#ifdef CONFIG_BK7258_BT_IPC
  ret = bk7258_bt_hci_initialize();
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_BLUETOOTH, ret);
    }
#endif

  lifecycle->startup_complete = true;
  return OK;
}

int bk7258_ap_lifecycle_publish_ready(FAR uint32_t *failure)
{
  FAR struct bk7258_ap_lifecycle_s *lifecycle =
    &g_bk7258_ap_lifecycle;
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
#ifdef CONFIG_BK7258_RPTUN
  volatile struct bk7258_rptun_control_s *rptun =
    bk7258_rptun_control();
#endif
#ifdef BK7258_AP_STARTUP_FREQ_VOTE
  int ret;
#endif

  if (failure == NULL)
    {
      return -EINVAL;
    }

  *failure = BK7258_AP_ERROR_NONE;
  if (!lifecycle->startup_complete || lifecycle->ready_published)
    {
      return -EALREADY;
    }

#ifdef BK7258_AP_STARTUP_FREQ_VOTE
  ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_CPU1,
                                 BK7258_PM_OPP_DEFAULT);
  if (ret < 0)
    {
      return bk7258_ap_startup_failed(
               failure, BK7258_AP_ERROR_PERIPHERALS, ret);
    }

  lifecycle->pm_startup_vote = false;
#endif

  state->error      = BK7258_AP_ERROR_NONE;
  state->last_event = BK7258_AP_EVENT_READY;
  state->state      = BK7258_AP_STATE_READY;
#ifdef CONFIG_BK7258_RPTUN
  rptun->ap_epoch   = state->generation;
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_READY, __ATOMIC_RELEASE);
#endif
  __asm volatile ("dmb sy" ::: "memory");
  bk7258_ap_mbox_send(BK7258_AP_EVENT_READY);
  lifecycle->ready_published = true;
  return OK;
}

