open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_lifecycle.c
void bk7258_ap_lifecycle_supervise(void)
{
  FAR struct bk7258_ap_lifecycle_s *lifecycle =
    &g_bk7258_ap_lifecycle;
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
#if defined(CONFIG_BK7258_AP_SUPERVISOR) && defined(CONFIG_BK7258_RPTUN)
  volatile struct bk7258_rptun_control_s *rptun =
    bk7258_rptun_control();
  struct sched_param startup_priority;
#endif
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
#endif
  uint32_t event;
  int ret;

  if (!lifecycle->ready_published)
    {
      bk7258_ap_lifecycle_fail_and_park(
        BK7258_AP_ERROR_BAD_BOOT_STATE);
    }

#ifdef CONFIG_BK7258_RPTUN
  if (lifecycle->priority_raised)
    {
#ifdef CONFIG_BK7258_AP_SUPERVISOR
      startup_priority = lifecycle->saved_priority;
      startup_priority.sched_priority =
        CONFIG_BK7258_AP_SUPERVISOR_PRIORITY;
      ret = sched_setparam(0, &startup_priority);
      if (ret < 0)
        {
          bk7258_ap_lifecycle_fail_and_park(
            BK7258_AP_ERROR_SUPERVISOR);
        }
#else
      (void)sched_setparam(0, &lifecycle->saved_priority);
#endif
      lifecycle->priority_raised = false;
    }
#endif

  for (; ; )
    {
      event = bk7258_ap_mbox_receive();
      if (event != BK7258_AP_EVENT_NONE)
        {
          state->last_event = event;
        }

      if (event == BK7258_AP_EVENT_STOP ||
          state->command == BK7258_AP_COMMAND_STOP)
        {
          state->state = BK7258_AP_STATE_STOPPING;
          __asm volatile ("dmb sy" ::: "memory");
#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
          ret = bk7258_ap_smp_secondary_stop(
            BK7258_CPU2_PROBE_STOP_TIMEOUT_MS);
#else
          ret = bk7258_cpu2_probe_stop(
            BK7258_CPU2_PROBE_STOP_TIMEOUT_MS);
#endif
          if (ret < 0)
            {
#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
              state->error = BK7258_AP_ERROR_CPU2_SMP_BOOTSTRAP;
#else
              state->error = BK7258_AP_ERROR_CPU2_PROBE;
#endif
              state->state = BK7258_AP_STATE_FAILED;
              state->last_event = BK7258_AP_EVENT_FAILED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_FAILED);
              break;
            }

          state->state = BK7258_AP_STATE_STOPPED;
          state->last_event = BK7258_AP_EVENT_STOPPED;
          bk7258_ap_mbox_send(BK7258_AP_EVENT_STOPPED);
          break;
        }

#ifdef CONFIG_BK7258_AP_IPI
      if (event == BK7258_AP_EVENT_IPI_TEST ||
          state->command == BK7258_AP_COMMAND_IPI_TEST)
        {
          volatile struct bk7258_ap_ipi_state_s *ipi =
            bk7258_ap_ipi_state();

          state->command = BK7258_AP_COMMAND_NONE;
          __asm volatile ("dmb sy" ::: "memory");
          ret = bk7258_ap_ipi_selftest(ipi->requested_count,
                                       ipi->timeout_ms);
          if (ret < 0)
            {
              state->error = BK7258_AP_ERROR_CPU2_IPI;
              state->last_event = BK7258_AP_EVENT_IPI_TEST_FAILED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_IPI_TEST_FAILED);
            }
          else
            {
              state->error = BK7258_AP_ERROR_NONE;
              state->last_event = BK7258_AP_EVENT_IPI_TEST_PASSED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_IPI_TEST_PASSED);
            }
        }
#endif

      state->heartbeat++;
#if defined(CONFIG_BK7258_AP_SUPERVISOR) && defined(CONFIG_BK7258_RPTUN)
      if (rptun->generation == state->generation)
        {
          rptun->ap_epoch = state->generation;
          __atomic_fetch_add(
            (uint32_t *)(uintptr_t)&rptun->ap_heartbeat, 1u,
            __ATOMIC_RELEASE);
        }
#endif
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
      smp->sleep_enter_count++;
#endif
      __asm volatile ("dmb sy; sev" ::: "memory");
      nxsig_usleep(BK7258_AP_HEARTBEAT_US);
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
      smp->sleep_return_count++;
      __asm volatile ("dmb sy" ::: "memory");
#endif
    }

  bk7258_ap_park();
}

void bk7258_ap_lifecycle_fail_and_park(uint32_t failure)
{
  if (failure == BK7258_AP_ERROR_NONE)
    {
      failure = BK7258_AP_ERROR_BAD_BOOT_STATE;
    }

  bk7258_ap_publish_failure(failure);
  bk7258_ap_park();
}
